{
  "_class_name": "AutoencoderKLCosmos",
  "_diffusers_version": "0.34.0.dev0",
  "attention_resolutions": [
    32
  ],
  "decode_block_out_channels": [
    256,
    512,
    512,
    512
  ],
  "encoder_block_out_channels": [
    128,
    256,
    512,
    512
  ],
  "in_channels": 3,
  "latent_channels": 16,
  "latents_mean": [
    0.11362757533788681,
    -0.017171695828437805,
    0.03071162849664688,
    0.020468616858124733,
    0.019314559176564217,
    0.02138567343354225,
    0.019993416965007782,
    0.021891867741942406,
    0.020119348540902138,
    0.01872694492340088,
    0.021686134859919548,
    0.022071482613682747,
    0.01986941136419773,
    0.017704127356410027,
    0.020676426589488983,
    0.0202824454754591,
    0.19125476479530334,
    0.04556972160935402,
    0.05955580249428749,
    0.05315534397959709,
    0.05496629327535629,
    0.05356264486908913,
    0.04856595769524574,
    0.05327453464269638,
    0.05410471558570862,
    0.05597148835659027,
    0.05524865910410881,
    0.051818735897541046,
    0.05071663111448288,
    0.052045371383428574,
    0.05641080439090729,
    0.05518041551113129,
    0.01306714117527008,
    0.03341160714626312,
    0.03847246244549751,
    0.028101854026317596,
    0.027901655063033104,
    0.02920026145875454,
    0.02823597379028797,
    0.026310328394174576,
    0.02785310335457325,
    0.028805073350667953,
    0.02977769263088703,
    0.031454406678676605,
    0.02888389490544796,
    0.03280773386359215,
    0.03484927490353584,
    0.03049197606742382,
    -0.0019772653467953205,
    0.07534956932067871,
    0.049638792872428894,
    0.05530892685055733,
    0.054108284413814545,
    0.052525412291288376,
    0.05029899254441261,
    0.05321024730801582,
    0.05149244889616966,
    0.05119210109114647,
    0.04643494635820389,
    0.04604526609182358,
    0.046316176652908325,
    0.04404101148247719,
    0.04403536394238472,
    0.04499494656920433,
    -0.029941828921437263,
    -0.047870032489299774,
    -0.010645583271980286,
    -0.01779823563992977,
    -0.014905018731951714,
    -0.02157517336308956,
    -0.02047779969871044,
    -0.021808160468935966,
    -0.0194537490606308,
    -0.020628631114959717,
    -0.021922089159488678,
    -0.02520638518035412,
    -0.022466560825705528,
    -0.024275334551930428,
    -0.02683362551033497,
    -0.02762005850672722,
    0.08019473403692245,
    -0.13005368411540985,
    -0.07568635791540146,
    -0.06082374230027199,
    -0.060361746698617935,
    -0.058753639459609985,
    -0.0592188723385334,
    -0.058697883039712906,
    -0.05273940786719322,
    -0.05256499722599983,
    -0.05346428230404854,
    -0.05456540733575821,
    -0.05365699902176857,
    -0.05656896531581879,
    -0.057285893708467484,
    -0.05321847274899483,
    0.1671840250492096,
    -0.003901461837813258,
    0.03794059902429581,
    0.03565610200166702,
    0.03554131090641022,
    0.03924074023962021,
    0.03873615339398384,
    0.04187328740954399,
    0.04226924106478691,
    0.04378717020153999,
    0.04684273898601532,
    0.05117613822221756,
    0.04547792300581932,
    0.05251586064696312,
    0.05048338696360588,
    0.04950783774256706,
    0.09564418345689774,
    0.05471280217170715,
    0.08183968812227249,
    0.07978633046150208,
    0.08076023310422897,
    0.08108604699373245,
    0.08011817932128906,
    0.0796557292342186,
    0.08187773078680038,
    0.0835026279091835,
    0.08101469278335571,
    0.07869409769773483,
    0.07744419574737549,
    0.07724520564079285,
    0.07830417901277542,
    0.0759979635477066,
    -0.049875665456056595,
    0.05923908203840256,
    -0.010587457567453384,
    -0.011776033788919449,
    -0.01116162072867155,
    -0.013641487807035446,
    -0.015460136346518993,
    -0.01172130461782217,
    -0.017800433561205864,
    -0.016483137384057045,
    -0.02100246772170067,
    -0.0210441704839468,
    -0.02482122741639614,
    -0.02611689455807209,
    -0.025611430406570435,
    -0.025973355397582054,
    -0.053646672517061234,
    0.08211684226989746,
    0.046869371086359024,
    0.04605640843510628,
    0.043041862547397614,
    0.039735499769449234,
    0.036867666989564896,
    0.04087112471461296,
    0.03704741224646568,
    0.03706400841474533,
    0.031200725585222244,
    0.03349090740084648,
    0.03319963067770004,
    0.032057810574769974,
    0.03195127099752426,
    0.03180480748414993,
    0.16427966952323914,
    -0.1104845330119133,
    -0.04595276340842247,
    -0.04982893168926239,
    -0.05213464796543121,
    -0.04809378460049629,
    -0.050803184509277344,
    -0.04992862790822983,
    -0.044933367520570755,
    -0.046761900186538696,
    -0.048847030848264694,
    -0.04627892002463341,
    -0.04913311451673508,
    -0.04955708608031273,
    -0.04533981531858444,
    -0.04570218175649643,
    -0.10612928122282028,
    -0.05121197551488876,
    -0.06761008501052856,
    -0.0725180059671402,
    -0.07265284657478333,
    -0.074178546667099,
    -0.07202412188053131,
    -0.07499026507139206,
    -0.07625480741262436,
    -0.07535747438669205,
    -0.07638787478208542,
    -0.0792030468583107,
    -0.0759606882929802,
    -0.07959417998790741,
    -0.08265036344528198,
    -0.07955470681190491,
    -0.1688891500234604,
    0.07532420009374619,
    0.04062594473361969,
    0.03375093266367912,
    0.033374518156051636,
    0.036993756890296936,
    0.0365113765001297,
    0.036110229790210724,
    0.03555621951818466,
    0.03378554433584213,
    0.030049804598093033,
    0.033955592662096024,
    0.029418472200632095,
    0.031564321368932724,
    0.034311726689338684,
    0.030168525874614716,
    -0.03415358439087868,
    -0.016995728015899658,
    -0.040292952209711075,
    -0.049121566116809845,
    -0.04988580197095871,
    -0.04917917773127556,
    -0.049180563539266586,
    -0.052518896758556366,
    -0.05325506255030632,
    -0.05341973155736923,
    -0.04983328655362129,
    -0.048831455409526825,
    -0.04985548183321953,
    -0.04736718162894249,
    -0.04620270058512688,
    -0.0483609102666378,
    0.020556746050715446,
    0.03419799357652664,
    -0.029076693579554558,
    -0.04350508749485016,
    -0.04156143590807915,
    -0.04234420508146286,
    -0.04446109011769295,
    -0.04461774230003357,
    -0.04882838577032089,
    -0.04822345823049545,
    -0.04502492770552635,
    -0.05062440410256386,
    -0.05146912857890129,
    -0.046552665531635284,
    -0.048629943281412125,
    -0.048416152596473694,
    0.20312774181365967,
    -0.07208502292633057,
    -0.03635615482926369,
    -0.03556087613105774,
    -0.042461737990379333,
    -0.04195837676525116,
    -0.04293777793645859,
    -0.04071275517344475,
    -0.042405690997838974,
    -0.04125212877988815,
    -0.04395143687725067,
    -0.03959095850586891,
    -0.04044992849230766,
    -0.040158748626708984,
    -0.04088107496500015,
    -0.03885176032781601
  ],
  "latents_std": [
    0.5670027136802673,
    0.6548898220062256,
    0.6558942794799805,
    0.6652436852455139,
    0.6661978363990784,
    0.666638195514679,
    0.6720837950706482,
    0.6695597767829895,
    0.6692887544631958,
    0.6710878610610962,
    0.6709252595901489,
    0.6739746332168579,
    0.6789488196372986,
    0.6766831278800964,
    0.6776956915855408,
    0.6747955679893494,
    0.8524512052536011,
    0.868837296962738,
    0.8734808564186096,
    0.8845933675765991,
    0.8913588523864746,
    0.891050398349762,
    0.8971490859985352,
    0.8994747400283813,
    0.9020176529884338,
    0.9041182398796082,
    0.906926155090332,
    0.9084777235984802,
    0.9064871072769165,
    0.9100698232650757,
    0.9103343486785889,
    0.9054154753684998,
    0.8496035933494568,
    0.8586335182189941,
    0.8689531683921814,
    0.884606122970581,
    0.8924500346183777,
    0.8945170640945435,
    0.8993100523948669,
    0.9064735770225525,
    0.9033823609352112,
    0.9051007628440857,
    0.9100831151008606,
    0.9096121788024902,
    0.9123716950416565,
    0.9131317138671875,
    0.914355456829071,
    0.9156510233879089,
    0.9187710285186768,
    0.851551353931427,
    0.857804000377655,
    0.8699803352355957,
    0.8736526370048523,
    0.8816176652908325,
    0.881510317325592,
    0.887589156627655,
    0.8901551365852356,
    0.8924557566642761,
    0.8927622437477112,
    0.894504964351654,
    0.9005420207977295,
    0.8999413251876831,
    0.9013610482215881,
    0.9011489152908325,
    0.7775575518608093,
    0.8145685195922852,
    0.8191184401512146,
    0.8313707113265991,
    0.8382047414779663,
    0.8389037251472473,
    0.8440110087394714,
    0.844251811504364,
    0.8473935723304749,
    0.8479875326156616,
    0.8524958491325378,
    0.8511499762535095,
    0.8516093492507935,
    0.8562635779380798,
    0.856778621673584,
    0.8564102649688721,
    0.6990351676940918,
    0.7169788479804993,
    0.7169691324234009,
    0.7258316874504089,
    0.729317307472229,
    0.7325412631034851,
    0.7358697652816772,
    0.7373496890068054,
    0.7366458177566528,
    0.7408490777015686,
    0.7439932227134705,
    0.7447181940078735,
    0.7449318766593933,
    0.7482457756996155,
    0.7502487301826477,
    0.7527480125427246,
    0.8187142014503479,
    0.8225188255310059,
    0.8261602520942688,
    0.8316448330879211,
    0.8407237529754639,
    0.8396466970443726,
    0.841433048248291,
    0.848807692527771,
    0.8503468036651611,
    0.8519694805145264,
    0.8521105051040649,
    0.8538666367530823,
    0.8541001677513123,
    0.8543934226036072,
    0.8584784865379333,
    0.8538527488708496,
    0.6758398413658142,
    0.6825984716415405,
    0.6919885277748108,
    0.6992884278297424,
    0.7019432783126831,
    0.7046700119972229,
    0.7075554728507996,
    0.7091785669326782,
    0.7100769877433777,
    0.7096350193023682,
    0.7106407880783081,
    0.7102733254432678,
    0.7129116654396057,
    0.7153753638267517,
    0.7190250754356384,
    0.716041624546051,
    0.7245098948478699,
    0.719799280166626,
    0.7205737829208374,
    0.7303546071052551,
    0.7332962155342102,
    0.7366002798080444,
    0.7389146089553833,
    0.7427999377250671,
    0.7410569190979004,
    0.7400243282318115,
    0.7425758838653564,
    0.7441611886024475,
    0.7454389929771423,
    0.7469444274902344,
    0.7474706172943115,
    0.7458640336990356,
    0.9017698764801025,
    0.9099067449569702,
    0.9110680222511292,
    0.9216378331184387,
    0.9239023327827454,
    0.9305619597434998,
    0.9348220229148865,
    0.9364241361618042,
    0.9385837912559509,
    0.9406497478485107,
    0.9407893419265747,
    0.9432571530342102,
    0.9495530128479004,
    0.9481470584869385,
    0.95144122838974,
    0.9492307305335999,
    0.49853548407554626,
    0.6496810913085938,
    0.6427654027938843,
    0.6496639251708984,
    0.6487663984298706,
    0.6520355939865112,
    0.6584241986274719,
    0.6535161137580872,
    0.654643714427948,
    0.6574859023094177,
    0.6562633514404297,
    0.6612374782562256,
    0.6612117886543274,
    0.6607794165611267,
    0.6604015231132507,
    0.6647490859031677,
    0.619865894317627,
    0.6913813352584839,
    0.6884557008743286,
    0.6955842971801758,
    0.6976540088653564,
    0.7001534700393677,
    0.705295979976654,
    0.7046875357627869,
    0.7039952278137207,
    0.7047998905181885,
    0.7088757157325745,
    0.7112686634063721,
    0.7097226977348328,
    0.7124993205070496,
    0.7123194932937622,
    0.7117560505867004,
    0.35586974024772644,
    0.6872385740280151,
    0.6897321939468384,
    0.6995847821235657,
    0.6943452954292297,
    0.6995818018913269,
    0.7098021507263184,
    0.6989945769309998,
    0.7027168869972229,
    0.700950562953949,
    0.6991285085678101,
    0.7052269577980042,
    0.7039217352867126,
    0.7091691493988037,
    0.7058573365211487,
    0.7037354111671448,
    0.9810133576393127,
    0.890247642993927,
    0.896072506904602,
    0.906781792640686,
    0.9130866527557373,
    0.9181234836578369,
    0.9198082685470581,
    0.924806535243988,
    0.9263566732406616,
    0.92887943983078,
    0.9333807229995728,
    0.9346809387207031,
    0.9361943602561951,
    0.939060628414154,
    0.9419177174568176,
    0.9447172284126282,
    0.832027792930603,
    0.8410623073577881,
    0.8446363210678101,
    0.8582950830459595,
    0.863196611404419,
    0.8675134181976318,
    0.8691433668136597,
    0.8708592057228088,
    0.8728635907173157,
    0.8753739595413208,
    0.8793113827705383,
    0.8805447816848755,
    0.8811838030815125,
    0.8887255787849426,
    0.889424741268158,
    0.8893482685089111,
    0.440253347158432,
    0.6306161284446716,
    0.6311061382293701,
    0.6360195875167847,
    0.6395812034606934,
    0.6410434246063232,
    0.650199294090271,
    0.650279700756073,
    0.643559455871582,
    0.6465720534324646,
    0.648470938205719,
    0.6472811698913574,
    0.6497294306755066,
    0.6516297459602356,
    0.6532804369926453,
    0.6491477489471436
  ],
  "num_layers": 2,
  "out_channels": 3,
  "patch_size": 4,
  "patch_type": "haar",
  "resolution": 1024,
  "scaling_factor": 1.0,
  "spatial_compression_ratio": 8,
  "temporal_compression_ratio": 8
}
